# Найти корни квадратного уравнения Ax² + Bx + C = 0

a = int(input('Введите первый коэффициент: '))
b = int(input('Введите второй коэффициент: '))
c = int(input('Введите третий коэффициент: '))

d = b**2-4*a*c
if d<0:
    print('Корней нет')
elif d == 0:
    x = -b/2*a
    print(x)
else: 
    x1 = round((-b+d**0.5)/2*a, 2) 
    x2 = round((-b-d**0.5)/2*a, 2)
    print('x1=', x1, 'x2=', x2)
