# Вывести на экран числа от -N до N

a=5
for i in range(-a, a+1):
    print(i, end = ' ')